content/posts/APL-DNN-tut.md
---
title: "APL DNN tutorial"
date: 2023-07-24T00:00:00+02:00
draft: false
---

## APL neural net tutorial {#apl-neural-net-tutorial}

The “Learn APL with Neural Networks” YouTube series aims at teaching you APL while
building a basic machine learning framework from the ground up.

By the time you are done, you will have created a machine learning framework and used it
to train a neural network that recognises handwritten digits.  You will also be able to
tackle other problems you pick because of the flexibility of what you created!

[Learn APL with Neural Networks](<https://www.youtube.com/playlist?list=PLgTqamKi1MS3p-O0QAgjv5vt4NY5OgpiM>)

\#content
